#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<math.h>
//第一题
//假设有两种微生物X和Y，X出生后每隔3分钟分裂一次（数目加倍），Y出生后每隔2分钟分裂一次（数目加倍）。
//一个新出生的X，半分钟之后吃掉1个Y，且从此开始每隔1分钟吃掉1个Y。已知新出生的X = 10，Y = 89，求60分钟后Y的数目。
//若X = 10，Y = 90呢？
//本题的要求就是写出这两种初始条件下，60分钟后Y的数目。
//题目的结果令你震惊吗？这不是简单的数字游戏！真实的生物圈有着同样脆弱的性质！
//也许因为你消灭的那只Y就是最终导致Y种群灭绝的最后一根稻草！

// i= 0,x = 10,y = 89| i = 1， x = 10, y = y-x| i=2， x = 10 ,y = 79 |
// i=3,x=10,y = 69   | i = 4,x = 10 y = 158| i=5,x = 10,y=158-x=148
// i=6,x=x*2=20 y = 148 | i = 7 ,x = 20,y = 148-x = 128
//由此可见 x的数量不用管 一到时间就翻倍即可 y的数量当i为奇数时就减去一个x(每隔一分钟) 这道题要是改为且从此开始每隔一分钟吃n个Y就难了(n!=1)
//int main() 
//{
//	int x = 10;
//	int y = 90;
//	int i = 0;
//	for (i = 0; i<120;i++)//i表示30s
//	{
//		if (i % 2 == 1)//判断是否为奇数 是的话 y就被x吃
//		{
//			y = y - x;
//		}
//		if (i % 4 == 0)//每俩分钟y的数量翻倍
//		{
//			y = 2 * y;
//		}
//		if (i % 6 == 0)//每三分钟x的数量翻倍
//		{
//			x = 2 * x;
//		}
//	}
//	printf("x = %d y = %d ",x,y);//x = 10485760 y = -979369984 //也就是说x = 10 y = 89时 y在60分钟结果为0
//	//若x = 10 y = 90 x = 10485760 y = 94371840
//	return 0;
//}

//第二题：古堡算式 福尔摩斯到某古堡探险，看到门上写着一个奇怪的算式：ABCDE* ? = EDCBA。
//他对华生说：“ABCDE应该代表不同的数字，问号也代表某个数字！” 华生：“我猜也是！”，于是，两人沉默了好久，还是没有算出合适的结果来。
//请你利用计算机的优势，找到破解的答案，把ABCDE所代表的数字写出来。
//暴力杯 雀氏暴力 没看到ABCDE代表不同的数字这个条件
//int main() 
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	int e = 0;
//	int x = 0;
//	for (int a = 1; a <=9; a++)
//	{
//		for (int b = 0; b<=9; b++)
//		{
//			for (int c = 0; c<=9; c++)
//			{
//				for (int d = 0; d<=9; d++)
//				{
//					for (int e = 0; e<=9; e++)
//					{
//						for (int x = 0; x<=9; x++)
//						{
//							if ( ((a * 10000 + b * 1000 + c * 100 + d * 10 + e) * x) == (e * 10000 + d * 1000 + c * 100 + b * 10 + a))
//							{
//								if (a!=b &&a!=c&&a!=d&&a!=e&&b!=c&&b!=d&&b!=e&&c!=d&&c!=e&&d!=e)
//								{
//									printf("a = %d  b = %d  c = %d d = %d e = %d ?= %d \n", a, b, c, d, e, x);
//									//巨笨的方法 算出结果为a = 2  b = 1  c = 9 d = 7 e = 8 ?= 4
//								}
//							}
//							
//						}
//					}
//				}
//			}
//		}
//	}
//	return 0;
//}
//方法2
//由于这5个数分别是个位十位百位千位 所以可以用取余的方法表示这五个数 注意int型的最大长度是32767
//所以要用10w以上的数 不能用int型
//要细心细心在细心 每一步都要想清楚再打
//int main() 
//{
//	 int a,b,c,d,e ;//范围是 -2147483647~+2147483647
//	 long int i = 0;
//	for (i = 10000; i <= 99999; i++)//注意这个数一定>=10000 <=99999所以起始条件写上i=10000 终止条件<=999999
//	{
//		a = i / 10000;//a = i % 10000;错误 例如a=34000 %10000 = 4000
//		b = (i / 1000) % 10;
//		c = (i / 100) % 10;
//		d = (i / 10) % 10;
//		e = i % 10;
//		int x = 0;
//		for (x = 0; x <= 9; x++)
//		{
//			if ((e * 10000 + d * 1000 + c * 100 + b * 10 + a) == i*x)
//			{
//				if(a != b && a != c && a != d && a != e && b != c && b != d && b != e && c != d && c != e && d != e)
//				{
//					printf("%d %d", i,x);
//				}	
//			}
//		}
//	}
//}